nxp-mcuxpresso/mcux-soc-svd/MCXN946T/MCXN946T_cm33_core0.xml
        <register>
          <name>RRCR0</name>
          <description>Round Robin Control Register 0</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RR_EN</name>
              <description>Round-Robin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR_TRG_SEL</name>
              <description>Round-Robin Trigger Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>External trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Internal trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR_NSAM</name>
              <description>Number of Sample Clocks</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAIT_0</name>
                  <description>0 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_1</name>
                  <description>1 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_2</name>
                  <description>2 clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_3</name>
                  <description>3 clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR_CLK_SEL</name>
              <description>Round Robin Clock Source Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RR0</name>
                  <description>Select Round Robin clock Source 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR1</name>
                  <description>Select Round Robin clock Source 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR2</name>
                  <description>Select Round Robin clock Source 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR3</name>
                  <description>Select Round Robin clock Source 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR_INITMOD</name>
              <description>Initialization Delay Modulus</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOD_63</name>
                  <description>63 cycles (same as 111111b)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_1</name>
                  <description>1 to 63 cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_2</name>
                  <description>1 to 63 cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_3</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_4</name>
                  <description>1 to 63 cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_5</name>
                  <description>1 to 63 cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_6</name>
                  <description>1 to 63 cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_7</name>
                  <description>1 to 63 cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_8</name>
                  <description>1 to 63 cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_9</name>
                  <description>1 to 63 cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_10</name>
                  <description>1 to 63 cycles</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_58</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_59</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_60</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_61</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_62</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_1_63_63</name>
                  <description>1 to 63 cycles</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR_SAMPLE_CNT</name>
              <description>Number of Sample for One Channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_0</name>
                  <description>1 samples</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_1</name>
                  <description>2 samples</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_2</name>
                  <description>3 samples</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_3</name>
                  <description>4 samples</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_4</name>
                  <description>5 samples</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5</name>
                  <description>6 samples</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_6</name>
                  <description>7 samples</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7</name>
                  <description>8 samples</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_8</name>
                  <description>9 samples</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_9</name>
                  <description>10 samples</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_10</name>
                  <description>11 samples</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_11</name>
                  <description>12 samples</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_12</name>
                  <description>13 samples</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_13</name>
                  <description>14 samples</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_14</name>
                  <description>15 samples</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_15</name>
                  <description>16 samples</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RR_SAMPLE_THRESHOLD</name>
              <description>Sample Time Threshold</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_0</name>
                  <description>At least 1 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_1</name>
                  <description>At least 2 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_2</name>
                  <description>At least 3 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_3</name>
                  <description>At least 4 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_4</name>
                  <description>At least 5 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5</name>
                  <description>At least 6 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_6</name>
                  <description>At least 7 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7</name>
                  <description>At least 8 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_8</name>
                  <description>At least 9 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_9</name>
                  <description>At least 10 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_10</name>
                  <description>At least 11 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_11</name>
                  <description>At least 12 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_12</name>
                  <description>At least 13 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_13</name>
                  <description>At least 14 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_14</name>
                  <description>At least 15 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_15</name>
                  <description>At least 16 sampled &quot;1&quot;, the final result is &quot;1&quot;</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
