nxp-mcuxpresso/mcux-soc-svd/MCXN946T/MCXN946T_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ENET0</name>
      <description>ENET</description>
      <groupName>ENET</groupName>
      <baseAddress>0x40100000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x11F0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETHERNET</name>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>ETHERNET_PMT</name>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>ETHERNET_MACLP</name>
        <value>141</value>
      </interrupt>
      <registers>
        <register>
          <name>MAC_CONFIGURATION</name>
          <description>MAC Configuration</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RE</name>
              <description>Receiver Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Receiver is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Receiver is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Transmitter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Transmitter is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRELEN</name>
              <description>Preamble Length for Transmit packets</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_7BYTES</name>
                  <description>7 bytes of preamble</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_5BYTES</name>
                  <description>5 bytes of preamble</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3BYTES</name>
                  <description>3 bytes of preamble</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC</name>
              <description>Deferral Check</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Deferral check function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Deferral check function is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Back-Off Limit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN_N_10</name>
                  <description>k = min(n,10)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN_N_8</name>
                  <description>k = min(n,8)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN_N_4</name>
                  <description>k = min(n,4)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN_N_1</name>
                  <description>k = min(n,1)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DR</name>
              <description>Disable Retry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Retry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Retry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCRS</name>
              <description>Disable Carrier Sense During Transmission</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Carrier Sense During Transmission</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Carrier Sense During Transmission</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DO</name>
              <description>Disable Receive Own</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Receive Own</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Receive Own</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECRSFD</name>
              <description>Enable Carrier Sense Before Transmission in Full-Duplex Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ECRSFD is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>ECRSFD is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LM</name>
              <description>Loopback Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Loopback is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Loopback is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM</name>
              <description>Duplex Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HDUPLX</name>
                  <description>Half-duplex mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDUPLX</name>
                  <description>Full-duplex mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FES</name>
              <description>Speed</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_10_1000M</name>
                  <description>10 Mbps when PS bit is 1 and 1 Gbps when PS bit is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_100_2500M</name>
                  <description>100 Mbps when PS bit is 1 and 2.5 Gbps when PS bit is 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS</name>
              <description>Port Select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_1000_2500M</name>
                  <description>For 1000 or 2500 Mbps operations</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_10_100M</name>
                  <description>For 10 or 100 Mbps operations</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JE</name>
              <description>Jumbo Packet Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Jumbo packet is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Jumbo packet is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JD</name>
              <description>Jabber Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Jabber is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Jabber is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD</name>
              <description>Watchdog Disable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Watchdog is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Watchdog is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACS</name>
              <description>Automatic Pad or CRC Stripping</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Automatic Pad or CRC Stripping is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Automatic Pad or CRC Stripping is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CST</name>
              <description>CRC stripping for Type packets</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>CRC stripping for Type packets is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>CRC stripping for Type packets is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S2KP</name>
              <description>IEEE 802.3as Support for 2K Packets</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Support upto 2K packet is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Support upto 2K packet is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPSLCE</name>
              <description>Giant Packet Size Limit Control Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Giant Packet Size Limit Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Giant Packet Size Limit Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPG</name>
              <description>Inter-Packet Gap</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPG96</name>
                  <description>96 bit times IPG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG88</name>
                  <description>88 bit times IPG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG80</name>
                  <description>80 bit times IPG</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG72</name>
                  <description>72 bit times IPG</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG64</name>
                  <description>64 bit times IPG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG56</name>
                  <description>56 bit times IPG</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG48</name>
                  <description>48 bit times IPG</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG40</name>
                  <description>40 bit times IPG</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPC</name>
              <description>Checksum Offload</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>IP header/payload checksum checking is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>IP header/payload checksum checking is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SARC</name>
              <description>Source Address Insertion or Replacement Control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SA_CTRL_IN</name>
                  <description>mti_sa_ctrl_i and ati_sa_ctrl_i input signals control the SA field generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC0_INS_SA</name>
                  <description>Contents of MAC Addr-0 inserted in SA field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC0_REP_SA</name>
                  <description>Contents of MAC Addr-0 replaces SA field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC1_INS_SA</name>
                  <description>Contents of MAC Addr-1 inserted in SA field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC1_REP_SA</name>
                  <description>Contents of MAC Addr-1 replaces SA field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
